"""
Домашнє завдання: Основи Python

**1.** Створіть три змінні з правильними іменами (англійською мовою): 
одну для збереження віку, 
одну для імені студента, 
одну для позначення чи є особа студентом. 
Додайте коментарі до кожної змінної.
"""
age = 25 #вік особи
name = any #ім'я особи
student = True #статус студента
"""

**2.** Рзкоментуйте та виправте помилки в наступних назвах змінних.
Поясніть у коментарях, чому початкові назви неправильні:
"""
name_2 = "John" #назва змінної не може починатись з цифри
user_age = 25 #у назві змінної не можуть використовуватись спеціальні знаки "-""
price = 100 #у назві змінної не можуть використовуватись спеціальні знаки, такі як "$""
class_type = "Math" #назвою змінної не може бути слово зі списка віключень
"""
**3.** Створіть змінну з описовим ім'ям для збереження максимальної кількості студентів у групі. 
Присвойте їй значення 30.
"""
max_students_in_group = 30 # максимальна кількість студентів у групі

"""
**4.** Створіть змінні для збереження: 
назви курсу, 
кількості годин, 
вартості курсу. 
Використайте правильне іменування змінних.
"""
course_name = any #назва курсу
quantity_of_hours = any #кількість годин
course_cost = any #вартість курсу

"""
**5.** Розрхуйте та виведіть Затрати курсу: 
Затрати курсу  = кількість годин * вартість курсу
Використайте правильне іменування змінних.
"""
quantity_of_hours = 20 #кількість годин
course_cost = 20 #вартість курсу
full_course_cost = quantity_of_hours * course_cost #вартість повного курсу
print("Повні затрати на курс становлять" , full_course_cost) #розрахунок та виведення затрат на курс

"""
**6.** Створіть змінні з різними способами запису чисел:
- Десяткове число: 42
- Двійкове число: 101010 (в двійковій системі)
- Шістнадцяткове число: 2A (в шістнадцятковій системі)
- Восьмеричне число: 52 (в восьмеричній системі)
"""
decimal_num = 42 # Десяткове число
binary_num = 101010 # Двійкове число
hex_num = '2A' # Шістнадцяткове число
octal_num = 52 # Восьмеричне число
"""
**7.** Виконайте всі арифметичні операції (+, -, *, /, //, %, **) з числами 17 та 5. 
Виведіть результати з поясненнями.
"""
a = 17
b = 5
result_01 = a + b #додавання
result_02 = a - b #віднімання
result_03 = a * b #множення
result_04 = a / b #ділення
result_05 = a // b #цілочислене ділення
result_06 = a % b #
result_07 = a ** b #
print("Результат виконання арифметичних операцій:")
print("Результат виконання операції '+': ", result_01)
print("Результат виконання операції '-': ",result_02)
print("Результат виконання операції '*': ",result_03)
print("Результат виконання операції '/': ",result_04)
print("Результат виконання операції '//': ",result_05)
print("Результат виконання операції '%': ",result_06)
print("Результат виконання операції '**': ",result_07)

"""
**8.** Обчисліть площу кола з радіусом 7.5. Використайте значення π = 3.14159.
"""
radius = 7.5 #радіус кола
π = 3.14159 #число π
square = π * radius ** 2 #формула площі круга
print("Площа кола з радіусом" , radius , "дорівнює" , square) #вивід результату обчислення площі кола
"""
**9.** Обчисліть залишок від ділення будь-якого числа на 7. 
Виведіть результат з числами 50, 33, 14.
"""
number_00 = 7
number_01 = 50 
number_02 = 33
number_03 = 14
result_01 = number_01 % number_00 
result_02 = number_02 % number_00
result_03 = number_03 % number_00
print("Залишок від ділення" , number_01 , "на" , number_00 , " рівен " , result_01)
print("Залишок від ділення" , number_02 , "на" , number_00 , " рівен " , result_02)
print("Залишок від ділення" , number_03 , "на" , number_00 , " рівен " , result_03)

"""
**10.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Площа Чорного моря становить 436 402 км2, а площа Азовського
моря становить 37 800 км2. Яку площу займають Чорне та Азов-
ське моря разом?
"""
square_of_azov_sea = 436402
square_of_black_sea = 37800
total_square = square_of_azov_sea + square_of_black_sea
print("Площа Чорного моря становить", square_of_azov_sea , "км2, а площа Азовського \
моря становить" , square_of_black_sea , "км2. Яку площу займають Чорне та \
Азовське моря разом?")
print("Відповідь: загальна площа Чорного та Азовського морів становить" , total_square , "км2.")
# код вводити тут

"""
**11.** Створіть рядок з вашим повним ім'ям та виведіть:
- Перший символ
- Останній символ  
- Довжину рядка
"""
name = "Сеник Олександр Володимирович"
print(name)
print("Перший символ:" , name [0])
print("Останній символ:" , name [-1])
print("Довжина рядка:" , len (name))

"""
**12.** Створіть рядок "Would you tell me, please, which way I ought to go from here?" 
та отримайте з нього підстрічки:
- Перші 6 символів
- Останні 11 символів

"""
line = "Would you tell me, please, which way I ought to go from here?"
print(line)
print("Перші 6 символів:", line [:6])
print("Останні 11 символів:" , line [-11:])

"""
**13.** Створіть багаторядковий рядок (використовуючи потрійні лапки) зі своїм улюбленим віршем або цитатою.
"""
quote = '''Борітеся — поборете,
Вам Бог помагає!
За вас правда, за вас слава,
І воля святая!
Т.Г.Шевченко, "Кавказ"'''
print(quote)

"""
**14.** Поєднайте два рядки "Hello" та "World" у різні способи (з пробілом, з комою, з новим рядком).
"""
hello = "Hello"
world = "World"
print(hello , world)
print(hello,",",world ,sep='')
print('Hello \n World')

"""
**15.** Створіть рядок з символами, які потребують екранування (лапки, зворотна коса риска).
"""
print("Подвійні лапки \"В своїй хаті своя й правда, і сила, і воля\"")
print("Одинарні лапки \'В своїй хаті своя й правда, і сила, і воля\'")
print("Коса риска \\В своїй хаті своя й правда, і сила, і воля\\")

"""
**16.** Напишіть код, який запитує у користувача його ім'я та вік, 
а потім виводить привітання у форматі: "Привіт, [ім'я]! Тобі [вік] років."
"""
name = input("Введіть ваше ім'я: ")
age = input("Введіть ваш вік: ")
print("Привіт," , name, "!")
print("Тобі" , age, "років")

"""

**17.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Ігор займається фотографією. Він вирішив зібрати всі свої 232
фотографії та вклеїти в альбом. На одній сторінці може бути
розміщено щонайбільше 8 фото. Скільки сторінок знадобиться
Ігорю, щоб вклеїти всі фото?
"""
photos = 232 # кількість фото у Ігоря
one_page_photos = 8 # кількість фото, що може бути розміщено на одній сторінці альбому
number_of_pages = photos / one_page_photos # підрахунок кількості сторінок
print("Ігор займається фотографією. Він вирішив зібрати всі свої" , photos,
       "фотографії та вклеїти в альбом. На одній сторінці може бути розміщено щонайбільше" , one_page_photos, 
       "фото. Скільки сторінок знадобиться Ігорю, щоб вклеїти всі фото?")
print("Відповідь: Ігорю знадобиться" , number_of_pages , "сторінок, щоб вклеїти всі" , photos , "фотографії")


"""
**18.** Напишіть код який запитує у користувача 
його улюблений колір та число, а потім створює персоналізоване
повідомлення використовуючи f-string форматування.
"""
fav_color = input("Введіть ваш улюблений колір:")
fav_number = input("Введіть ваше улюблене число:")
print(f"Привіт, друже. тепер ми знаємо, що твій улюблений колір" , fav_color, ", а улюблене число -" , fav_number)


"""
**19.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Мережа супермаркетів має 3 склади, де всього розміщено
375 291 товар. На першому та другому складах перебуває
250 449 товарів. На другому та третьому – 222 950 товарів.
Знайдіть кількість товарів, що розміщені на кожному складі.
"""
num_of_warehouses = 3 # кількість складів у супермаркета
quantity_of_goods = 375291 # кількість товарів на складах
quantity_1_and_2 = 250449 # кількість товарів на складі 1 та 2
quantity_2_and_3 = 222950 # Кількість товарів на складі 2 та 3
<<<<<<< HEAD

=======
quantity_of_goods_1 = quantity_of_goods - quantity_2_and_3 # кількість ьоварів на першому складі
quantity_of_goods_2 = quantity_1_and_2 - quantity_of_goods_1 # кількість ьоварів на другому складі
quantity_of_goods_3 = quantity_of_goods - quantity_1_and_2 # кількість ьоварів на третьому складі
print("Мережа супермаркетів має 3 склади, де всього розміщено" , quantity_of_goods , 
      "товар. На першому та другому складах перебуває" , quantity_1_and_2 , 
      "товарів. На другому та третьому –" , quantity_2_and_3 , 
      "товарів. Знайдіть кількість товарів, що розміщені на кожному складі.")
print("Відповідь: На першому складі розміщено" , 
      quantity_of_goods_1 ,"товар, на другому - " , 
      quantity_of_goods_2 , "товарів, на третьому - " , 
      quantity_of_goods_3 , "товари")
>>>>>>> 63bc96e6aa7a225188720949fdb5332f3e772bd4


"""
**20.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Михайло разом з батьками вирішили купити комп’ютер, ско-
риставшись послугою «Оплата частинами». Відомо, що сплачу-
вати необхідно буде півтора року по 1179 грн/місяць. Обчисліть
вартість комп’ютера.
"""
<<<<<<< HEAD
# код вводити тут
=======
num_of_payments = 18 # кількість платежів
sum_of_payment = 1179 # сума одного платежу
computer_cost = number_of_pages * sum_of_payment # вартість комп'ютера
print("Михайло разом з батьками вирішили купити комп’ютер, \n" \
"скориставшись послугою «Оплата частинами». \n" \
" Відомо, що сплачувати необхідно буде півтора року по" , sum_of_payment ,
"грн/місяць. Обчисліть вартість комп’ютера.")
print("Відповідь: Вартість комп'ютера становитиме" , computer_cost , "гривня")
>>>>>>> 63bc96e6aa7a225188720949fdb5332f3e772bd4
